Tekla.Structures.Drawing.PourObject
The PourObject class contains methods related to pours.
A pour is a drawing object derived from a model object.
It represents a drawing pour that has a reference to the
actual pour in the model database.

Tekla.Structures.Drawing.PourObject.Attributes
The attributes of the pour.
For more information see Tekla.Structures.Drawing.PourObject.PourAttributes.

Tekla.Structures.Drawing.PourObject.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PourObject.#ctor(System.Boolean)
Create instance of Pour

Tekla.Structures.Drawing.PourObject.#ctor
Create instance of Pour

Tekla.Structures.Drawing.PourObject.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.PourObject.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.PourObject.Insert
NOT YET IMPLEMENTED.
Returns: False.

Tekla.Structures.Drawing.PourObject.Select
Calls the system to select and retrieve the object.
Returns: True on success.